[["What's your in-game name?","Feydakin or Yueh (depends what class you need more of)"],["Class?","Mage or Holy Priest (again, open to playing either depending on what's needed)"],["Race?","Gnome Mage or Human Priest (unless you need more dwarf for Fear Ward)"],["Professions?","Mage is Enchanter/Tailor, Priest is Herb/Alch"],["What spec will you be playing? Link from a talent calculator (https://classic.wowhead.com/talent-calc)","Frost Mage to start, Fire once we progress, or Holy Priest. I'll use the standard maximized best specs for each."],["How did you hear about Sharp and Shiny, and what made you apply?","My friend Zidjian invited me to join you all. I played WoW from the last year of vanilla thru Cata on a daily basis. Took a break a few years and came back last year when newest expansion came out and played a few months with another friend until I got sick of his guildmates. Have planned to play Classic since it was announced and would like a good guild to play with."],["How extensive is your organized raiding experience? The more details the better","I worked my way up to being the Hunter Class Leader for Blood Oath Clan on the Gilneas server during TBC. I've run many raids (not during vanilla though). I'd run the alt raid group thru stuff after our main guild raids were done. I played the roles of main tank and lead healer during WotLK."],["What do you think is more important for a successful PvE progression guild: attitude or skill? Why?","If people can work together despite attitude then skill is what's most important to progress. Everyone has to pull their weight. But one bad attitude can ruin the morale of an entire raid. It is what made me quit playing last fall despite having a rl friend in the guild."],["When are your usual playtimes? What occupies the bulk of your time in-game? (PvP, PvE, RP, etc.)","PvE is what I like doing most. Running dungeons and running raids. I'll run stuff to help gear others when I don't even need gear. As for schedule, I should be able to typically meet your raid schedule unless something drastic changes happen which I don't currently expect."],["Do you intend to get PvP ranks? (not required)","Not unless I get board. From what I remember of vanilla, I won't have time to do PvP if I plan to hardcore raid. I'll be too busy farming mats when I'm not running something in a group."],["We are rolling on an RP-PvE server, is this in anyway an issue for you? The guild itself is not an RP guild, but we welcome those who wish to","No issue. Haven't done rp in the past though. Already have my toons saved on your server via Zidjian's direction."],["Do you have a referral or know anyone in the guild?","Zidjian"],["Calzones or strombolis?","Calzones, though if I was really having Italian I'd go for a Porketta Sandwich."]]