[["What's your in-game name?","Xaelyrion"],["Class?","Paladin"],["Race?","Human"],["Level?","60"],["Professions?","Armorsmithing 300 / Mining 300 (who made that fancy fire resist ❤️ /wink)"],["What spec will you be playing? Link from a talent calculator (https://classic.wowhead.com/talent-calc)","Holy"],["Are you coming from another guild? If so, which guild and why are you leaving?","Yes, Willingly Suboptimal, it was the guild that I led on this server, it splintered  on the evening of November 16th and I disbanded what was left a few hours later. What I'd would consider to be the primary reason for the splintering of what was our Main Team, was it was a team half composed of those interested in fullfilling the goals we had set out to do, and half comprised of those who *pretended* they wanted to achieve those same goals. The half of the team that wanted to take the game more casually than intended, got what they wanted and are living with the results of those decisions today. Half of the serious minded folks quit, some moved on, some stayed with Serendipity to make the most out of what was left. I decided to take a step back from the game and disbanded WSO, whose remnants formed a new guild Serendipity, and haven't played the game, either Retail or Classic, since."],["How did you hear about Sharp and Shiny, and what made you apply?","I first heard of S+S back in probably April of 2019 when Harry was the first other person to recruit for what would eventually be the Bloodsail Buccaneers Server on the god awful discord we had to recruit in. What has me applying is that it was obvious, even more than six months ago, that this guild had very similar goals to what I personally wanted to do in the game. It was, and is nice to see that there are folks who can look at the game seemingly in a similar way to myself, and do so on an RP server. I tried and failed to build a guild that achieved these goals, while S+S succeeded. Once in-game, and having the in-world interactions I had with S+S folks, and the communication between myself and Hydd, I grew quick to respect what S+S was going for. Furthermore, especially down the line once I learned the type of raiding atmosphere this guild keeps, that is always a top notch trait to look for. The atmosphere, and what type of individuals S+S wants in their guild, and which ones they don't. Those are very attractive traits."],["How extensive is your organized raiding experience? The more details the better","I've been raiding almost non-stop for the last decade. I started playing the game in patch 2.1, but didn't hit endgame until 3.3.5 when I was 16. My first real organized raiding exp came in Tier 11 in Blackwing Decent. I ironically did not raid 4.2, but did return for Dragon Soul. 4.3 was my first tier raiding the hardest difficulty and was the first time I killed the last boss before the next tier (expac in that case) released. It was in T14 that I started raiding 25man, and raided all of Mists with that same guild, Dominion on A-Stormrage (Now Dominion on H-Area52). SoO was my first tier raiding were we cleared it on the hardest difficulty, and then farmed it for ages. I left that guild at the end of MoP to play with all my friends who were returning to the game for Warlords, we had a guild together and raided the first tier before damn near everyone quit because WoD. I joined a new guild in the last 2 months of that tier, Progression on A-Stormrage, and we were able to kill Blackhand Mythic before 6.2. That guild went on to fall apart on Mythic Archimonde progression the week of the 4/4 valor upgrades, which was a huge disappointment, so I applied to a new guild. I joined Smitus and Friends (soon after to be renamed SnF) on A-Sargeras in November on 2015, and before Classic, this is the last guild I was in before I made Willingly Suboptimal. I raided with SnF all the way until it \"disbanded\" in Feb 2017, only to get start raiding (albeit a bit more casually) a few months later in Tomb of Sargeras. SnF went on to rename itself to xD on H-Area 52 (why, I still don't know, but its the same group, except Smitus himself, he quit years ago) and they still raid today. In November 2017, our dreams came true, and Classic was officially announced. I raided casually 7.2 and 7.3, farming ABT for mounts/xmog, all while having my eyes on Classic. As BfA came out, I stopped with the Retail game entirely, and messed around on Light's Hope while Willingly Suboptimal took shape."],["Do you have parses on warcraftlogs? If so, please provide a link.","https://www.warcraftlogs.com/character/us/sargeras/xaelyrion?zone=17&new=true#zone=10 These are probably the best, and most consistant that I can show. That character linked also has logs from 6.2, and the other raids from that tier. Following link are my Stormrage logs from before I was in SnF https://www.warcraftlogs.com/character/us/stormrage/xaelyrion?zone=8&new=true#difficulty=4&private=1 . My Classic Logs (this is bullshit, they changed the guildname on them) https://classic.warcraftlogs.com/character/us/bloodsail-buccaneers/xaelyrion#zone=1000&partition=1"],["What do you think is more important for a successful PvE progression guild: attitude or skill? Why?","Attitude, easily. More that enough skilled players exist in the game today, that I'd much prefer to play with the slightly less skilled but much more likeable raider, than some dickhead who thinks he's amazing because he consistently is Orange on Warcraftlogs. Especially in Classic, good players are abundant enough that any asshole can be replaced and raid performance won't change."],["When are your usual playtimes? What occupies the bulk of your time in-game? (PvP, PvE, RP, etc.)","When I stopped logging in on November 16th, I had over 31 days /played on my Paladin. I play *a lot*. I don't have much of an outside the house life. This time around I imagine I wouldn't be online as much, but I'm usually on (and always accessable in discord) from about Noon to 4am daily. I'm mainly a PvE player. Recently, the bulk of my in-game time in Classic went into running a large guild, which was very busy work. While raiding hardcore in mythic, it was usually farming Mythic+ or getting alts split ready."],["We are on an RP-PvE server, but as a guild, we do not participate in RP. Is this in any way an issue?","Not at all."],["Do you have a referral or know anyone in the guild?","Hydd, Harry, a few other names I recognize"],["Calzones or strombolis?",""]]